import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
"""


"""
labels = ["Інвестиції у технорозвиток", "Провал проєкту із застосуванням Цифрових двійників", "Додатковий маркетинг", "Інвестиції у кібербезпеку", "Підтримка від держави", "Інвестиції в освіту", "Інтерес зі сторони замовників", "Недовіра до технології", "Цифровізація", "Глобалізація", "Ізоляція технологій великими компаніями", "Унікальний підхід на кожне нове застосування", "Моделювання ризиків", "Покращення моделей та засобів", "Модульність", "Оптимізація управлінських процесів", "Відсутність формалізації", "Спеціалісти", "Розширення кола користувачів", "Покращення формалізації теоретичної бази", "Покращення сумісності технології"]
gt = pd.read_csv("final_cognitive.csv").set_index("Unnamed: 0")


data = [[0,0,0,0,0,0,0.5,0,0,0,0.3,0.7,0.5,0.6,0.6,0.5,0.7,-0.1,0,0,0],
        [0,0,0,0,0,0,-0.8,0.9,0,0,0,0, -0.2,0,0,0,0,0,0,0,0],
        [0,0,0,0,0,0,0.4,-0.5, 0, 0, 0.4, 0,0,0,0,0,0,0.3,0,0,0],
        [0, 0, 0, 0, 0, 0, 0,-0.2,0,0,0,0,0.2,0,0,0,0,0,0,0,0],
        [0, 0, 0, 0, 0, 0, 0,-0.1,0.2,0.1,-0.4,0,0,0.2,0,0.2,0,0,0,0,0],
        [0, 0, 0, 0, 0, 0, 0,-0.1,0.1,0,-0.1,0.1,0, 0.3, 0,0,-0.6,0.8,0,0,0],
        [0.4, 0,0.3, 0.2,0.2, 0.2, 0,0,0,0,0.5,0,0,0,0,0,0,0.3,0.6,0,0.2],
        [-0.5,0,-0.3,0,-0.3,0,-0.4,0,0,0,0,0,0,-0.1,0,0,0.1,-0.2,-0.3,0,0],
        [0.4,0,0.3,0.3,0.3,0,0,-0.2,0,0.7,0.5,-0.1,0.4,0.5,0.3,0,0,0.2,0,0,0.3],
        [0,0.1,0,0,0,0,0.1,0.2,0,0,0.4,0,0,0,-0.2,-0.3,0,0,0.3,0,0.4],
        [0,0,0,0,0,0,0.2,0.8,0.6,0.5,0,-0.4,0.4,0,-0.1, -0.4,0,0,-0.1,-0.1,-0.3],
        [0.3,0,-0.1,0,0,0,0.4,-0.1,0,0,-0.2,0,0.4,0.5,0,0.8,0,0.7,-0.4,-0.1, -0.3],
        [0.1, -0.3, 0, 0, 0.3, 0, 0.1, 0, 0.3, 0, 0.2, 0.2, 0, 0.4, 0.1, 0.6, 0, 0, 0.2, 0.1, 0],
        [0, 0, -0.1, 0, 0, 0, 0.4, 0,0,0,0,0, 0.6, 0, 0.5, 0.6,0.6, 0, 0.4,0.8,0.3],
        [0,0,0,0,0,0,0.1,0,0.4,0.3, -0.1, 0.8, 0,0,0,0.6,0,0,0.7,0.3,0.9],
        [0.5, -0.4, 0.1, 0, 0.5, 0.3, 0.6,0,0.1,0.2,0, 0.4, 0,0,0,0,0,0.6,0,0.3,0],
        [0,0,0,0,-0.2,0.6,0,0.7,0,0,0.8,1,0.6,0,0,0,0.5,0,0,-0.8,0],
        [0,0,0,0,0,0.3,0.9, 0,-0.5,0.4,0.3,0,0,0,0.5,0,-0.9,0,-0,1,0.4],
        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0.6],
        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0.4,0,0],
        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
        ]

df = pd.DataFrame(data=data,columns=labels,index=labels)
#print(df)
#df.to_csv('out.csv', index=True)
#print(pd.read_csv("out.csv").set_index("Unnamed: 0"))
print((df < 0).sum().sum())
print((df > 0).sum().sum())
#sns.heatmap(df, annot=True)
#plt.show()
kt = pd.read_excel("data_raw_1.xlsx").set_index("Unnamed: 0")
print(kt)







